tutorials/multiRegionPlateFin_new/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Density - Dimensions: kg/m3
rho             rho [1 -3 0 0 0 0 0] 0.9944;//SBB change to 0.9944;

mu              mu [ 1 -1 -1 0 0 0 0 ] 2.0821e-5;

// Specific heat - Dimensions: J/kg-K
cp              cp  [0 2 -2 -1 0 0 0] 1.016e03;//SBB change to 1.016e+03

// Thermal conductivity - Dimensions: W/m-K
k            	k   [1 1 -3 -1 0 0 0] 630.0;


// ************************************************************************* //
