tutorials/multiRegionPlateFin_new/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    Wall
    {
        type            zeroGradient;
    }
    Symmetry
    {
        type            symmetryPlane;
        value           $internalField;
    }
    InWallFluid
    {
        type            zeroGradient;
    }
    CyclicFluid
    {
        type fan;
        patchType cyclic;
        f List<scalar> 1(0);
        value uniform 0;
    }
    OutWallFluid
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
