tutorials/multiRegionPlateFin_new/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 273;

boundaryField
{
    Wall
    {
        type            fixedValue;
        value           uniform 283;
    }
    Symmetry
    {
        type            symmetryPlane;
        value           $internalField;
    }
    InWallFluid
    {
        type                    zeroGradient;
        /*
        type                    regionCoupleTemperature;
        neighbourRegionName     solid;
        neighbourPatchName      OutSolid;
        neighbourFieldName      T;
        K                       1.0;
        value                   $internalField;
        */
    }
    CyclicFluid
    {
        type            cyclic;
        //value           $internalField;
    }
    OutWallFluid
    {
        type                    zeroGradient;
        /*
        type                    regionCoupleTemperature;
        neighbourRegionName     solid;
        neighbourPatchName      InSolid;
        neighbourFieldName      T;
        K                       1.0;
        value                   $internalField;
        */
    }
    fluid_to_solid
    {
        type                    regionCoupleTemperature;
        neighbourRegionName     solid;
        neighbourPatchName      solid_to_fluid;
        neighbourFieldName      T;
        K                       1.0;
        value                   $internalField;
    }
}

// ************************************************************************* //
